/* 1
 1 এর উপরের অংশ দ্বারা সার্ভার end এর সেটআপ  করা হয়েছে 
*////

/* 2
const categories = require('./data/categories.json'); 
এই লাইন কোড দ্বারা client site থেকে server site-এ ডাটা লোড কে নির্দেশ করা হয় 
*////

/* 3
তারপর যেহেতু আমরা অন্য API  থেকে কাজটা করব সেজন্য cors-কে
  ব্যবহার করা হয়েছে এবং এটা অত্যাবশ্যক 
*////

/* 4
তারপরে জিনিসটা ঠিকমত চলতেছে কিনা সেটাকে পরীক্ষা করার জন্য
 Dragon is runnig  দিয়ে চেক করেছি
*////

/* 5
এটা দ্বারা যত category-র data আছে jshon থেকে সব category-ওয়ালা 
data লোড করে server সাইটে রেখে, আবার server সাইট থেকে client সাইটে পাঠিয়ে 
দিয়েছি । এখানে server backend সাইট মূলত data storage বলে বিবেচিত হচ্ছে   
 *////

 /*  6
 নির্দিষ্ট আইডিয়ালা শুধুমাত্র একটাই হয় এক এর বেশি হয় না 
 তাই অনেকগুলোর ভিতর থেকে একটাকে বের করতে হলে find ব্যবহৃত হয়েছে 
 *////

 /* 7
 ক্যাটাগরি বলতে ওই ক্যাটাগরির মধ্যে অনেক দেশের অনেকগুলো
  নিউজ ওই একই ক্যাটাগরির হতে পারে বা  থাকতে পারে।। তাই filter করে
   ওই নির্দিষ্ট ক্যাটাগরি আইডিয়ালা নিউজ কে এক অথবা একের অধিকও হতে পারে তাই
    filter-র মাধ্যমে খুঁজে বের  করে ব্যবহার করা হয়েছে। 
 */